
"""
        ====================================================================
        ===========      Created on Wed Jun 24 13:30:27 2026     ===========
        ===========         Author: Khashayar Alipour            ===========
        ===========                IDE: spyder                   ===========
        ===========             python operators                 ===========
        ====================================================================
"""





#===================================
'''    Arithmatic operators      '''
#===================================
# عملگرهای حسابی


a = 10
b = 3

# subtraction (تفریق)
print(a - b)      # 7

# addition (جمع)
print(a + b)      # 13

# multiplication (ضرب)
print(a * b)      # 30

# exponentiation (توان)
print(a ** b)     # 1000

# division (تقسیم اعشاری)
print(a / b)      # 3.3333333333333335

# floor division (تقسیم صحیح)
print(a // b)     # 3

# modulus (باقی مانده)
print(a % b)      # 1


# عملگر / نتیجهٔ اعشاری را برمی‌گرداند
# اما // قسمت اعشاری را حذف کرده و فقط بخش صحیح خارج‌قسمت را نگه





#===================================
'''    Comparison operators      '''
#===================================
# عملگر مقایسه‌ای
# <class 'bool'>


# equal to (تساوی)
a = 10
b = 10
print(a == b)   # True


# not equal to (مخالف)
a = 10
b = 5
print(a != b)   # True


# greater than (بزرگتر)
a = 10
b = 5
print(a > b)    # True


# lesser than (کوچکتر)
a = 10
b = 5
print(a < b)    # False


# greater than or equal to ( بزگتر مساوی)
a = 10
b = 10
print(a >= b)   # True


# less than or equal (کوچکتر مساوی)
a = 10
b = 10
print(a <= b)   # True



# پایتون اجازه می‌دهد چند مقایسه را پشت سر هم بنویسی:
x = 7
print(1 < x < 10)    # True
print((1 < x) and (x < 10))   # True






#===================================
'''      Logical operators      '''
#===================================
# عملگرهای منطقی


# logical and
# فقط زمانی True می‌شود که هر دو شرط درست باشند
age = 25
salary = 5000
print(age > 18 and salary > 3000)    # True

print(10 > 5 and 3 > 7)   # True  شرط دوم غلطه


# logical or
# اگر حداقل یکی از شرط‌ها درست باشد، نتیجه True می‌شود
print(10 > 5 or 3 > 7)    # True   چون شرط دوم درسته


# logical not (نقیض)
# این عملگر نتیجه همه چیز رو برعکس میکنه
print(not True)   # True

age = 15
print(not (age >= 18))   # True
# چون age >= 18 برابر False است و not آن را به True تبدیل می‌کند






#=========================================
'''   Augmented Assignment operators   '''
#=========================================
# عملگر انتساب همراه با محاسبه


# assignment
x = 10
print(x)    # 10

# add and assign
x = 10
x += 5      # x = x + 5
print(x)    # 15

# subtract adn assign
x = 10
x -= 3      # x = x - 3
print(x)    # 7

# multiply and assign
x = 10
x *= 4      # x = x * 4
print(x)    # 40

# exponent and assign
x = 2
x **= 3     # x = x ** 3
print(x)    # 8

# modulus and assign
x = 10
x %= 3      # x = x % 3
print(x)    # 1

# divide and assign
x = 10
x /= 4      # x = x / 4
print(x)    # 2.5    نتیجه همیشه اعشاری میشه

# floor divide and assign
x = 10
x //= 4     # x = x // 4
print(x)    # 2






#======================================
'''   Bitwise operators assignment  '''
#======================================
# عملگرهای بیتی
# برای فهمشان باید اعداد را به صورت دودویی (Binary) ببینی
# هر رقم 0 یا 1 را یک بیت (Bit) می‌گویند
# مثلا عدد 5 میشه 101


#_________________
# bitwise AND 
# بیتی 1 می‌شود که هر دو بیت 1 باشند
a = 5   # 101
b = 3   # 011
print(a & b)   #1
#   101
#   011
#   ---
#   001
#_________________


#_________________
# bitwise OR
# اگر حداقل یکی از بیت‌ها 1 باشد، نتیجه 1 می‌شود
a = 5
b = 3
print(a | b)   #7
#   101
#   011
#   ---
#   111
#_________________


#_________________
# bitwise NOT
# تمام بیت‌ها را برعکس می‌کند
~x == -(x + 1)
a = 5
print(~a)   #-6
print(~10)  #-11
#_________________


#_________________
# bitwise XOR
# اگر بیت‌ها متفاوت باشند 1 می‌شود
a = 5   # 101
b = 3   # 011
print(a ^ b)   #6
#   101
#   011
#   ---
#   110
#_________________


#_________________
# left shift
# بیت‌ها را به چپ منتقل می‌کند
# x << n = x * (2 ** n)   برای اعداد مثبت

a = 5
print(a << 1)   #10    یعنی تمام بیت‌ها رو یک خانه به سمت چپ هل بدی
# 101 -> 1010

print(5 << 2)   #20    یعنی تمام بیت‌ها 2 خانه به سمت چپ هل بدی
# 101 -> 10100
#_________________


#_________________
# right shift
# بیت‌ها را به راست منتقل می‌کند
# x >> n = x // (2 ** n)   برای اعداد مثبت

a = 20
print(a >> 1)   #10
# 10100 -> 1010

print(20 >> 2)   #5
# 10100 -> 101
#_________________



# ------------------
# چیزی که اکثر برنامه نویس ها حفظ میکنن:
x << 1   # ضرب در 2
x << 2   # ضرب در 4
x << 3   # ضرب در 8

x >> 1   # تقسیم صحیح بر 2
x >> 2   # تقسیم صحیح بر 4
x >> 3   # تقسیم صحیح بر 8
# ------------------








#==============================
'''   Membership operators  '''
#==============================
# عملگرهای عضویت
# بررسی می‌کنند که یک مقدار داخل یک مجموعه داده (مثل لیست، رشته، تاپل و ...) وجود دارد یا نه
# نتیجه boolean میباشد


# in (وجود دارد)
numbers = [10, 20, 30, 40]
print(20 in numbers)    # True
print(50 in numbers)    # False

text = "Python"
print("y" in text)    # True

text = "I love Python"
print("Python" in text)    # True



# not in (وجود ندارد)
 # برعکس in عمل می‌کند
# اگر مقدار وجود نداشته باشد، True برمی‌گرداند

numbers = [10, 20, 30, 40]
print(50 not in numbers)    # True    چون 50 داخل لیست نیست







#===========================
'''  Identity operators  '''
#===========================
# عملگرهای هویتی
# این دو عملگر چک می‌کنند آیا دو متغیر دقیقاً به یک شیء در حافظه اشاره می‌کنند یا نه


#----- is (آیا دو متغیر دقیقاً یک شیء هستند؟) -----
a = [1, 2, 3]
b = a
print(a is b)    # True
# چون a و b به همان لیست واحد در حافظه اشاره می‌کنند

# در پایتون معمولاً از is برای None استفاده می‌شود
name = None
if name is None:
    print("No name")
if name is not None:
    print("Name exists")



#----- is not (آیا دو متغیر شیءهای متفاوتی هستند؟) -----
a = [1, 2, 3]
b = [1, 2, 3]
print(a is not b)    # True
# چون با اینکه محتوا یکسان است، دو شیء جداگانه در حافظه هستند



#==========================
# عملگر == یعنی آیا مقدارها برابرند؟ و فقط مقدار رو مقایسه میکنه و به هویت کاری نداره
a = [1, 2, 3]
b = [1, 2, 3]
# print(a==b)    True
# print(a in b)   False

# مثال تصویری
a = [1, 2, 3]
b = a
c = [1, 2, 3]

'''
a ──┐
    ├──> [1, 2, 3]
b ──┘
c ─────> [1, 2, 3]
'''

a == b   # True
a is b   # True

a == c   # True
a is c   # False


# بنابراین:
     # عضویت → in و not in    
    # هویت شیء → is و is not    
    # برابری مقدار → == و !=    
#==========================














































